<template lang="pug">
section
  h2.H.text_x4 Дополнительные модули
  .subText.mb-4 Платформа «Умный город Росатома» позволяет объединить все муниципальные сервисы. Поключайте дополнительные модули или интегрируйте ваши готовые решения с возможностью их адаптации на платформе.

  .additionalModules
    .Card.p-4.bg_1
      .flex.x_sb
        h3.H Общественный транспорт
        .icon
          svg(width='60', height='60', viewBox='0 0 60 60', fill='none', xmlns='http://www.w3.org/2000/svg')
            path(id="public-transport" fill-rule='evenodd', clip-rule='evenodd',
              d='M18.043 29.0528H40.7792V19.5803H18.043V29.0528ZM37.9316 40.4221C36.3611 40.4221 35.0898 39.1508 35.0898 37.5803C35.0898 36.0076 36.3611 34.7363 37.9316 34.7363C39.5043 34.7363 40.7756 36.0076 40.7756 37.5803C40.7756 39.1508 39.5043 40.4221 37.9316 40.4221V40.4221ZM20.8809 40.422C19.3104 40.422 18.0391 39.1507 18.0391 37.5802C18.0391 36.0075 19.3104 34.7362 20.8809 34.7362C22.4536 34.7362 23.7226 36.0075 23.7226 37.5802C23.7226 39.1507 22.4536 40.422 20.8809 40.422V40.422ZM29.4083 12C21.0338 12 14.25 12.9473 14.25 19.578V38.5275C14.25 40.2037 14.9903 41.691 16.1445 42.7328V46.1055C16.1445 47.1472 16.9973 48 18.039 48H19.9335C20.9865 48 21.828 47.1472 21.828 46.1055V44.211H36.9863V46.1055C36.9863 47.1472 37.83 48 38.883 48H40.7775C41.817 48 42.6698 47.1472 42.6698 46.1055V42.7328C43.8263 41.691 44.5665 40.2037 44.5665 38.5275V19.578C44.5665 12.9473 37.7805 12 29.4083 12V12Z', fill='#CDCDCD')

      
      .flex
        .Tag Жителям
        .ml-2.Tag.green Туристам 
      p.my-3 Узнавайте, когда приедет нужный автобус в режиме реального времени. Планируйте свои поездки по городу

    .Card.p-4.bg_2
      .flex.x_sb
        h3.H Уборка улиц
        .icon
          svg(width="60" height="60" viewBox="0 0 60 60" fill="none"
            xmlns="http://www.w3.org/2000/svg")
            path(id="cleaning-streets" fill-rule="evenodd" clip-rule="evenodd"
              d="M27.75 14.1087C27.75 12.9432 28.6927 12.0004 29.8582 12.0004C31.0237 12.0004 31.9665 12.9432 31.9665 14.1087V27.6087H27.75V14.1087ZM36.7877 29.7192H22.9322C20.8712 29.7192 19.1162 31.2087 18.7742 33.2337H40.948C40.6037 31.2087 38.8487 29.7192 36.7877 29.7192ZM41.2725 35.3442H18.4462L16.5 48.0004H43.2188L41.2725 35.3442Z" fill="#CDCDCD")
      .Tag Жителям
      p.my-3 Узнайте заранее график уборки улиц, выбирайте маршрут объезда и удобное место парковки, чтобы не помешать спецтехнике.

    .Card.p-4.bg_3
      .flex.x_sb
        h3.H Оплата услуг
        .icon
          svg(width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg")
            path(id="payment" fill-rule="evenodd" clip-rule="evenodd"
              d="M40.5008 35.9992H45.75C46.1663 35.9992 46.4993 36.3344 46.4993 36.7507V40.4992C46.4993 42.1529 45.1538 43.5007 43.5 43.5007H14.9993C13.3455 43.5007 12 42.1529 12 40.4992V19.4999C12 17.8462 13.3455 16.5007 14.9993 16.5007H43.5C45.1538 16.5007 46.4993 17.8462 46.4993 19.4999V23.2507C46.4993 23.6647 46.1663 23.9999 45.75 23.9999H40.5008C37.191 23.9999 34.5 26.6909 34.5 30.0007C34.5 33.3082 37.191 35.9992 40.5008 35.9992ZM39 29.9993C39 30.8273 39.6728 31.5001 40.5007 31.5001C41.3265 31.5001 41.9993 30.8273 41.9993 29.9993C41.9993 29.1736 41.3265 28.5008 40.5007 28.5008C39.6728 28.5008 39 29.1736 39 29.9993ZM40.5007 25.4993H45.75C46.992 25.4993 48 26.5096 48 27.7493V32.2493C48 33.4891 46.992 34.4993 45.75 34.4993H40.5007C38.0167 34.4993 36.0007 32.4811 36.0007 29.9993C36.0007 27.5176 38.0167 25.4993 40.5007 25.4993Z" fill="#CDCDCD")
      .Tag Жителям
      p.my-3 Оплачивайте спортивные абонементы, школьное питание и другие городские услуги в одном месте.

    .Card.p-4.bg_4
      .flex.x_sb
        h3.H Достопримечательности
        .icon
          svg(width='60', height='60', viewBox='0 0 60 60', fill='none', xmlns='http://www.w3.org/2000/svg')
            path(id="places" fill-rule='evenodd', clip-rule='evenodd',
              d='M45.7453 24.6175H14.2521C13.7368 24.6175 13.2891 24.2665 13.1676 23.7648C13.0461 23.263 13.2823 22.7455 13.7391 22.5093L29.4868 14.3755C29.8086 14.209 30.1888 14.209 30.5128 14.3755L46.2111 22.4845C46.5958 22.6623 46.8636 23.0493 46.8636 23.5015C46.8636 24.118 46.3641 24.6175 45.7476 24.6175H45.7453ZM15.9834 26.4919V37.7666H15.2566C14.6401 37.7666 14.1406 38.2661 14.1406 38.8826V39.6094H45.8544V38.8826C45.8544 38.2661 45.3549 37.7666 44.7384 37.7666H44.0139V26.4919H38.0941V37.7666H32.9551V26.4919H27.0376V37.7666H21.9009V26.4919H15.9834ZM46.1257 41.4826H46.8638C47.4915 41.4826 48 41.9911 48 42.6189C48 43.2444 47.4915 43.7551 46.8638 43.7551H44.9895H15.0082H13.1363C12.5085 43.7551 12 43.2444 12 42.6189C12 41.9911 12.5085 41.4826 13.1363 41.4826H13.8743H46.1257ZM46.1257 45.7291H46.8638C47.4915 45.7291 48 46.2376 48 46.8653C48 47.4908 47.4915 48.0016 46.8638 48.0016H44.9895H15.0082H13.1363C12.5085 48.0016 12 47.4908 12 46.8653C12 46.2376 12.5085 45.7291 13.1363 45.7291H13.8743H46.1257Z', fill='#CDCDCD')
      

      .flex
        .Tag Жителям
        .ml-2.Tag.green Туристам 

      p.my-3 Достопримечательности, туристические места, культурные объекты и график их работы. Планируйте свой досуг.

    .Card.p-4.bg_5
      .flex.x_sb
        h3.H Поликлиники и больницы
        .icon
          svg(width='60', height='60', viewBox='0 0 60 60', fill='none', xmlns='http://www.w3.org/2000/svg')
            path(id="clinics" fill-rule='evenodd', clip-rule='evenodd',
              d='M39.6233 19.1314H42.87C45.6938 19.1314 48 21.0844 48 23.9082V42.8667C48 45.6904 45.6938 48.0012 42.87 48.0012H17.1345C14.3063 48.0012 12 45.6882 12 42.8667V23.9082C12 21.0844 14.3063 19.1314 17.1345 19.1314H20.3767V17.1334C20.3767 14.3074 22.6898 12.0012 25.5113 12.0012H34.4932C37.3147 12.0012 39.6233 14.3074 39.6233 17.1334V19.1314ZM23.125 17.1335C23.125 15.8735 24.25 14.7485 25.51 14.7485H34.492C35.7475 14.7485 36.8725 15.8735 36.8725 17.1335V19.1315H23.125V17.1335ZM38.2493 37.0008H32.748V42.5021H27.2513V37.0008H21.75V30.1271H27.2513V24.6303H32.7502V30.1271H38.2493V37.0008Z', fill='#CDCDCD')
      .Tag Жителям
      p.my-3 Найдите ближайшую клинику, узнайте график её работы и запишитесь на приём, не выходя из дома.

    .Card.p-4.bg_6
      .flex.x_sb
        h3.H Площади в аренду
        .icon
          svg(width="60" height="60" viewBox="0 0 60 60" fill="none"
            xmlns="http://www.w3.org/2000/svg")
            path(id="buildings" fill-rule="evenodd" clip-rule="evenodd"
              d="M28.2023 15.3926C32.7248 10.8701 40.0845 10.8701 44.607 15.3926C49.1317 19.9174 49.1317 27.2771 44.607 31.8019C41.5177 34.8934 37.0448 35.8856 32.9137 34.5446L30.2093 37.2154C30.0113 37.4134 29.7435 37.5236 29.4622 37.5236H27.534V39.4879C27.534 39.7871 27.4058 40.0729 27.183 40.2754C26.9558 40.4756 26.6565 40.5746 26.3595 40.5341L24.7552 40.3474L24.5483 42.5704C24.501 43.0721 24.1005 43.4726 23.5965 43.5199L21.3757 43.7291L21.5625 45.3311C21.5985 45.6529 21.486 45.9701 21.2587 46.1996L19.7692 47.6914C19.5712 47.8894 19.3035 47.9996 19.0223 47.9996H13.0553C12.4725 47.9996 12 47.5294 12 46.9444V40.9796C12 40.7006 12.1125 40.4306 12.3105 40.2349L25.3763 27.1669C24.0375 23.0359 25.1108 18.4841 28.2023 15.3926ZM37.1506 22.8514C38.3859 24.0844 40.3906 24.0844 41.6259 22.8514C42.8589 21.6161 42.8589 19.6114 41.6259 18.3761C40.3906 17.1431 38.3859 17.1431 37.1506 18.3761C35.9176 19.6114 35.9176 21.6161 37.1506 22.8514Z" fill="#CDCDCD")
      .flex
        .Tag Жителям
        .ml-2.Tag.purple Предпринимателям 
      p.my-3 Поможет предпринимателям узнать, где в городе выгодно арендовать подходящее помещение.
</template>

<script>
export default {}
</script>

<style lang="stylus" scoped>

$green = #0AC06D;
$purple = #CE94F8;


.subText
  max-width 750px

.Tag
  font-size 14px
  color: #FFF;
  border-radius: 5px;
  font-weight: 800;
  display: inline-block;

  background: $blue_l;
  padding .3em .7em
  margin-bottom 1em

  &.green
    background $green

  &.purple
    background $purple


.additionalModules
  display: grid;
  grid-gap: 2em;
  grid-template-columns: repeat(auto-fill, minmax(300px, 1fr) ) ;

.icon
  background #F7F7F7


.bg_1:hover svg #public-transport {
    transition all 0.3s linear
    fill #0AC06D
    stroke transparent
  }
.bg_2:hover svg #cleaning-streets {
  transition all 0.3s linear
  fill #2D71F7
  stroke transparent
}
.bg_3:hover svg #payment {
  transition all 0.3s linear
  fill #2D71F7
  stroke transparent
}
.bg_4:hover svg #places {
  transition all 0.3s linear
  fill #0AC06D
  stroke transparent
}
.bg_5:hover svg #clinics {
  transition all 0.3s linear
  fill #2D71F7
  stroke transparent
}
.bg_6:hover svg #buildings {
  transition all 0.3s linear
  fill #CE94F8
  stroke transparent
}
</style>
