<template lang="pug">

article#TXT_privacy_policy
  h2.mb-3 Политика конфиденциальности персональных данных
  p.mb-3 Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую интернет-ресурс Умный {{ city.cityName }}, расположенный на доменном имени https://{{ city.city }}.rosatom.city/ (а также его субдоменах) (далее – Сайт), может получить о Пользователе во время использования Сайта (а также его субдоменов), его программ и его продуктов.
  h3.mb-3 1. Определение терминов
  p.mb-3 1.1 В настоящей Политике конфиденциальности используются следующие термины:
  p.mb-3 1.1.1. «Администрация сайта» (далее – Администрация) – (наименование ОМСУ или организации, которая ведет взаимодействие с гражданами посредством портала «Умный город»), и/или его уполномоченные на управление Сайтом сотрудники, действующие от имени (наименование ОМСУ или организации, которая ведет взаимодействие с гражданами посредством портала «Умный город»), которые организуют и (или) осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
  p.mb-3 1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).
  p.mb-3 1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
  p.mb-3 1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.
  p.mb-3 1.1.5. «Сайт» - это совокупность связанных между собой веб-страниц, размещенных в сети Интернет по уникальному адресу (URL): https://{{ city.city }}.rosatom.city/, а также его субдоменах.
  p.mb-3 1.1.6. «Субдомены» - это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие Сайту, а также другие временные страницы, внизу который указана контактная информация Администрации
  p.mb-3 1.1.5. «Пользователь сайта» (далее Пользователь) – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее информацию, материалы и продукты Сайта в рамках Пользовательского соглашения об использовании информационных сервисов, представленного на Сайте.
  p.mb-3 1.1.7. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.
  p.mb-3 1.1.8. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ на Сайт.
  p.mb-3 1.1.9. «Информационная система проекта «Умный Город» - информационной система, доступ к которой предоставляется с использованием Сайта в информационно-телекоммуникационной сети Интернет.
  h3.mb-3 2. Общие положения
  p.mb-3 2.1. Использование Сайта Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.
  p.mb-3 2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта.
  p.mb-3 2.3. Настоящая Политика конфиденциальности применяется к Сайту. Сайт не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте.
  p.mb-3 2.4. Администрация не проверяет достоверность персональных данных, предоставляемых Пользователем.
  h3.mb-3 3. Предмет политики конфиденциальности
  p.mb-3 3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при регистрации на Сайте, при подписке на информационную e-mail рассылку.
  p.mb-3 3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения форм на Сайте, или по запросу Администрации Сайта, и включают в себя следующую информацию:
  p.mb-3 3.2.1. фамилию, имя, отчество Пользователя;
  p.mb-3 3.2.2. контактный телефон Пользователя;
  p.mb-3 3.2.3. адрес электронной почты (e-mail);
  p.mb-3 3.2.4. адрес регистрации Пользователя/адрес фактического места проживания (при необходимости), в т.ч. город, регион, страна, индекс.
  p.mb-3 3.2.5. адрес места работы/учебы;
  p.mb-3 3.2.6. фотографию (при необходимости);
  p.mb-3 3.2.7. паспортные данные (при необходимости);
  p.mb-3 3.2.8. дата рождения;
  p.mb-3 3.2.9. сведения о половой принадлежности;
  p.mb-3 3.2.10. логин и пароль.
  p.mb-3 Пользователь также выражает свое согласие на обработку иной информации, которая может включать в себя: дополнительные данные, получаемые при доступе к информационной системе проекта «Умный Город», включающие в себя данные о технических средствах (устройствах), технологическом взаимодействии с информационной системой проекта «Умный Город» (в т.ч. IP-адрес хоста, вид операционной системы пользователя, тип браузера, географическое положение, поставщик услуг доступа в информационно-телекоммуникационную сеть Интернет) и последующих действиях Пользователя в информационной системе проекта «Умный Город», информацию, автоматически получаемую при доступе к информационной системе проекта «Умный Город» с использованием закладок (cookies).
  p.mb-3 В случаях, если это обусловлено тематикой реализуемых в Проекте мероприятий, Администрация вправе запрашивать дополнительные персональные данные Пользователей. Добровольно предоставляя такие данные, участник Проекта тем самым дает свое согласие на их обработку способами и в целях, указанных в настоящей Политике конфиденциальности.
  p.mb-3 3.3. Сайт защищает данные, которые автоматически передаются при посещении страниц:
  p.mb-3 - IP адрес;
  p.mb-3 - информация из cookies;
  p.mb-3 - информация о браузере
  p.mb-3 - время доступа;
  p.mb-3 - реферер (адрес предыдущей страницы).
  p.mb-3 3.3.1. Отключение cookies может повлечь невозможность доступа к частям Сайта, требующим авторизации.
  p.mb-3 3.3.2. Сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью предотвращения, выявления и решения технических проблем.
  p.mb-3 3.4. Любая иная персональная информация, неоговоренная выше (история посещения, используемые браузеры, операционные системы и т.д.), подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
  h3.mb-3 4. Цели сбора персональной информации пользователя
  p.mb-3 4.1. Персональные данные Пользователя Администрация может использовать в целях:
  p.mb-3 4.1.1. Идентификации Пользователя, зарегистрированного на Сайте, для его дальнейшей авторизации и других действий.
  p.mb-3 4.1.2. Предоставления Пользователю доступа к персонализированным данным Сайта.
  p.mb-3 4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, обработки запросов и заявок от Пользователя.
  p.mb-3 4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.
  p.mb-3 4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.
  p.mb-3 4.1.6. Создания учетной записи для использования частей Сайта, если Пользователь дал согласие на создание учетной записи.
  p.mb-3 4.1.7. Уведомления Пользователя по электронной почте.
  p.mb-3 4.1.8. Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием Сайта.
  p.mb-3 4.1.9. Предоставления Пользователю с его согласия специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Сайта.
  p.mb-3 4.1.10. Осуществления рекламной деятельности с согласия Пользователя.
  h3.mb-3 5. Способы и сроки обработки персональной информации.
  p.mb-3 5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.
  p.mb-3 5.2. Пользователь соглашается с тем, что Администрация вправе передавать персональные данные третьим лицам, в частности, организациям почтовой связи (в том числе электронной), операторам электросвязи, исключительно в целях выполнения запроса и заявки Пользователя, оформленной на Сайте, включая доставку документации или e-mail сообщений.
  p.mb-3 5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
  p.mb-3 5.4. Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
  p.mb-3 5.5. Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.
  h3.mb-3 6. Права и обязанности сторон
  p.mb-3 6.1. Пользователь вправе:
  p.mb-3 6.1.1. Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования Сайта, и давать согласие на их обработку.
  p.mb-3 6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.
  p.mb-3 6.1.3. Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных, если такое право не ограничено в соответствии с федеральными законами. Пользователь вправе требовать от Администрации уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав.
  p.mb-3 6.2. Администрация обязана:
  p.mb-3 6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.
  p.mb-3 6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2 и 5.3. настоящей Политики конфиденциальности.
  p.mb-3 6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.
  p.mb-3 6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.
  h3.mb-3 7. Ответственность сторон
  p.mb-3 7.1. Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.
  p.mb-3 7.2. В случае утраты или разглашения конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:
  p.mb-3 7.2.1. Стала публичным достоянием до её утраты или разглашения.
  p.mb-3 7.2.2. Была получена от третьей стороны до момента её получения Администрацией Ресурса.
  p.mb-3 7.2.3. Была разглашена с согласия Пользователя.
  p.mb-3 7.3. Пользователь несет полную ответственность за соблюдение требований законодательства РФ, в том числе законодательства о рекламе, об интеллектуальной собственности, но не ограничиваясь перечисленным, включая полную ответственность за содержание и форму материалов.
  p.mb-3 7.4. Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: изображения, файлы с данными, тексты и т. д.), к которой он может иметь доступ как к части Сайта, несет лицо, предоставившее такую информацию.
  p.mb-3 7.5. Пользователь соглашается, что информация, предоставленная ему на Сайте, может являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на Сайте.
  p.mb-3 Пользователь не вправе вносить изменения, продавать, распространять или создавать производные работы на основе таких объектов (полностью или в части), за исключением случаев, когда такие действия были разрешены в письменной форме собственниками таких объектов в соответствии с условиями отдельного соглашения.
  p.mb-3 7.6. В отношении текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на Сайте) допускается их распространение при условии, что будет дана ссылка на Сайт.
  p.mb-3 7.7. Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо содержания и иных коммуникационных данных, содержащихся на Сайте или передаваемых через него.
  p.mb-3 7.8. Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования либо невозможности использования Сайта, либо отдельных сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или поведения любого третьего лица на Сайте.
  p.mb-3 7.9. Администрация не несет ответственность за какую-либо информацию, размещенную пользователями на Сайте, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого согласия автора или иного правообладателя.
  p.mb-3 7.10. Администрация не несет ответственности: за аварии, сбои или перебои в функционировании информационной системы проекта «Умный Город», иных сервисов, взаимодействующих с ними информационных систем, связанные с нарушениями в работе оборудования, систем связи или сетей, которые обеспечиваются, подаются, эксплуатируются и/или обслуживаются третьими лицами; за ущерб, понесенный Пользователем в результате: наличия «вирусов» и иных вредоносных программ в оборудовании и программном обеспечении, используемом Пользователем для доступа к информационной системе проекта «Умный Город»; нарушения Пользователем положений настоящей Политики конфиденциальности и Пользовательского положения об использовании информационных сервисов; за неправомерные действия третьих лиц, в том числе связанных с использованием учетной записи Пользователя в информационной системе проекта «Умный Город», иных сервисах, а также с использованием сведений о нем, предоставленных им с использованием учетной записи Пользователя в информационной системе проекта «Умный Город», если такие сведения стали доступны третьим лицами не по вине Администрации.
  p.mb-3 Пользователь и Администрация освобождаются от ответственности за частичное или полное неисполнение обязательств в случае, если такое неисполнение явилось следствием непреодолимой силы, то есть чрезвычайных и неотвратимых обстоятельств, не зависящих от воли Пользователя и Администрации.
  h3.mb-3 8. Разрешение споров
  p.mb-3 8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения или предложения в электронном виде о досудебном урегулировании спора).
  p.mb-3 8.2. Получатель претензии в течение 30 (Тридцати) календарных дней со дня получения претензии в письменном или в электронном виде уведомляет заявителя претензии о результатах рассмотрения претензии.
  p.mb-3 8.3. При не достижении соглашения спор подлежит урегулированию в судебном порядке в государственных судах по месту нахождения Администрации (договорная подсудность) в соответствии с действующим законодательством Российской Федерации.
  p.mb-3 8.4. Настоящая Политика конфиденциальности регулируется и толкуется в соответствии с законодательством Российской Федерации. Вопросы, не урегулированные настоящей Политикой конфиденциальности, подлежат разрешению в соответствии с законодательством Российской Федерации. Все возможные споры, вытекающие из отношений, регулируемых настоящей Политикой конфиденциальности, разрешаются в порядке, установленном действующим законодательством Российской Федерации, по нормам российского права. Везде по тексту настоящей Политики конфиденциальности, если явно не указано иное, под термином «законодательство» понимается законодательство Российской Федерации.
  h3.mb-3 9. Дополнительные условия
  p.mb-3 9.1. Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
  p.mb-3 9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.
  p.mb-3 9.3. Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу: {{ city.city }}@rosatom.city.
  p.mb-3 9.4. Действующая Политика конфиденциальности размещена на странице по адресу https://{{ city.city }}.rosatom.city/politika.pdf.
  p.mb-3 Дата публикации: 01/07/2020.
  p.mb-3 Реквизиты (Администрации):
  p.mb-3 Наименование:
  p.mb-3 Адрес:
  p.mb-3 Телефон:
  p.mb-3 Эл. адрес:
</template>

<script>
export default {
  name: 'Agreement',
  props: {
    cityName: {
      type: String,
      required: true
    }
  },
  computed: {
    city() {
      return this.$store.state[this.cityName]
    }
  }
}
</script>

<style lang="stylus">
#TXT_privacy_policy
  height 60vh
  overflow-y scroll
</style>
