<template lang="pug">

article#TXT_user_agreement
  h2.mb-3 Соглашение о пользовании информационными системами и ресурсами города {{city.cityName}}
  h3.mb-3 Термины и определения
  p.mb-3 Оператор – (наименование ОМСУ или организации, которая ведет взаимодействие с гражданами посредством портала «Умный город»), осуществляющее свою деятельность в соответствии с законодательством Российской Федерации, нормативными правовыми актами (наименование региона) и (наименование города).
  p.mb-3 Пароль - уникальная последовательность буквенно-цифровых символов, формируемая в установленном порядке при регистрации в сервисе, информационной системе города {{city.cityName}} в целях обеспечения последующего доступа Пользователя к данной информационной системе, сервису.
  p.mb-3 Пользователь - физическое или юридическое лицо, желающее получить или получившее в установленном порядке доступ к сервисам, информационным ресурсам и информационным системам города {{city.cityName}}.
  p.mb-3 Регистрация - первичный ввод информации (персональных данных) для доступа к сервису, информационной системе, информационному ресурсу города {{city.cityName}}.
  p.mb-3 Сервис - программное приложение, программное и (или) техническое средство, обеспечивающее взаимодействие внутри или между информационными системами, информационными ресурсами города {{city.cityName}}.

  h3.mb-3 Общие положения
  p.mb-3 Настоящим Соглашением определяются права и обязанности Оператора и Пользователя при организации доступа Пользователя к информационным ресурсам города {{city.cityName}}, а также при использовании Пользователем функциональных возможностей сервисов и информационных систем города {{city.cityName}}. Соглашение вступает в силу с момента выражения Пользователем согласия с его условиями в порядке, предусмотренном пунктом 2.3 Соглашения.
  p.mb-3 Информационные системы города {{city.cityName}} предназначены для исполнения полномочий органов местного самоуправления  города {{city.cityName}}, подведомственных им организаций и функционируют в соответствии с законодательством Российской Федерации, нормативными правовыми актами (наименование региона) и (наименование города), правовыми актами органов исполнительной власти (наименование региона) и органов местного самоуправления города {{city.cityName}}.
  p.mb-3 Начиная использовать информационную систему города {{city.cityName}} и (или) сервис /отдельные функции в информационной системе города {{city.cityName}} и (или) сервисе, либо пройдя процедуру регистрации, Пользователь считается принявшим условия настоящего Соглашения в полном объеме.
  p.mb-3 Соглашение может быть изменено Оператором без специального уведомления Пользователей, новая редакция Соглашения вступает в силу с момента ее размещения в информационно- телекоммуникационной сети «Интернет» по указанному в настоящем пункте адресу, если иное не предусмотрено новой редакцией Соглашения. Любые изменения, дополнения, а также новые редакции Соглашения равно распространяются на всех пользователей, присоединившихся к Соглашению, в том числе присоединившихся к Соглашению ранее даты изменений, дополнений или новых редакций. В случае если Пользователь продолжает использовать функциональные возможности информационной системы и (или) сервиса после публикации изменений Соглашения, Пользователь тем самым признается принявшим соответствующие изменения. Действующая редакция Соглашения находится на странице цифровой платформы города {{city.cityName}} по адресу: https://ДОМЕН_ГОРОДА.rosatom.city/soglashenive.pdf.
  p.mb-3 В случае несогласия Пользователя с какими-либо из требований к сервису, информационной системе города {{city.cityName}}, установленных законодательством Российской Федерации, правовыми актами (наименование региона) и города {{city.cityName}}, актами Оператора, настоящим Соглашением, Пользователь не в праве пользоваться информационной системой.
  p.mb-3 Все материалы сайта доступны по лицензии Creative Commons Attribution 4.0 при условии ссылки на первоисточник (в случае использования материалов сайта в сети Интернет - интерактивная ссылка).
  p.mb-3 Регистрация Пользователя, использование сервисов, информационных систем и ресурсов города {{city.cityName}}.
  p.mb-3 Регистрация Пользователя в конкретной информационной системе города {{city.cityName}} и (или) сервисе осуществляется после предоставления Пользователем определенного набора сведений на web-странице информационной системы города {{city.cityName}} или с использованием сервиса, и создания учетной записи Пользователя в соответствии с требованиями к соответствующей информационной системе города {{city.cityName}}, сервису.
  p.mb-3 На любом этапе пользования информационной системы, информационного ресурса города {{city.cityName}} и (или) сервисов Пользователь обязуется предоставлять достоверную и полную информацию. Пользователь обязуется поддерживать предоставляемую им информацию в актуальном состоянии. Если Пользователь предоставляет неверную информацию или у Оператора есть основания полагать, что предоставленная Пользователем информация неполна или недостоверна, Оператор имеет право по своему усмотрению заблокировать либо удалить учетную запись Пользователя и (или) отказать Пользователю в использовании информационной системы информационного ресурса города {{city.cityName}}, сервиса (либо их отдельных функций).
  p.mb-3 Использование сервиса, информационной системы города {{city.cityName}} означает согласие Пользователя на обработку любой информации, в том числе необходимой для корректной работы и/или сбора статистики использования сервисов системы (в том числе cookie) или предоставляемой Пользователем самостоятельно, а также согласие на получение информации о предоставлении ему услуг, о деятельности органов государственной власти, органов местного самоуправления города {{city.cityName}} и подведомственных им организаций, иных организаций. Указанная информация может быть предоставлена с применением неголосовых коммуникаций (путем рассылки по сети подвижной радиотелефонной связи коротких текстовых sms-сообщений, рассылки ussd-сообщений и др.), посредством направления сведений по информационно- телекоммуникационной сети «Интернет» на предоставленный Пользователем номер телефона и (или) адрес электронной почты.
  p.mb-3 Обработка предоставляемых Пользователем персональных данных осуществляется Оператором в соответствии с Федеральным законом от 27 июля 2006 N 152-ФЗ «О персональных данных» и требованиями к соответствующей информационной системе. Оператор осуществляет обработку следующих персональных данных: ФИО, телефон, адрес электронной почты, адрес сайта. Пользователь имеет право требовать прекращения обработки персональных данных путём направления заявления по адресу электронной почты: ДОМЕН_ГОРОДА@rosatom.city.
  p.mb-3 Пользователь самостоятельно несет ответственность за безопасность (устойчивость к угадыванию) используемого им пароля, а также самостоятельно обеспечивает конфиденциальность своего пароля и других средств идентификации. Пользователь самостоятельно несет ответственность за все действия (а также их последствия), совершенные под учетной записью Пользователя в рамках или с использованием сервисов, информационных систем города {{city.cityName}}, включая случаи добровольной передачи Пользователем данных для доступа к учетной записи Пользователя третьим лицам на любых условиях (в том числе по договорам или соглашениям). При этом все действия в рамках или с использованием сервисов и информационных систем города {{city.cityName}}, совершенные под учетной записью Пользователя, считаются произведенными самим Пользователем, за исключением случаев, когда Пользователь заранее уведомил Оператора о несанкционированном доступе к сервисам и (или) информационным системам города {{city.cityName}} с использованием учетной записи Пользователя и/или о любом нарушении (подозрениях о нарушении) конфиденциальности своего пароля, других средств идентификации.
  p.mb-3 Пользователь обязан немедленно уведомить Оператора о любом случае несанкционированного (не разрешенного Пользователем) доступа к сервисам, информационным системам и информационным ресурсам города {{city.cityName}} с использованием учетной записи Пользователя и/или о любом нарушении (подозрениях о нарушении) конфиденциальности своего пароля, иных средств идентификации. В целях безопасности Пользователь обязан самостоятельно осуществлять безопасное завершение работы под своей учетной записью по окончании каждой сессии работы с соблюдением требований к соответствующему сервису, соответствующей информационной системе города- {{city.cityName}}. Оператор не отвечает за возможную потерю или порчу данных, а также другие последствия любого характера, которые могут произойти из-за нарушения Пользователем положений этой части Соглашения.
  p.mb-3 Оператор вправе в случаях, определенных настоящим Соглашениям, устанавливать ограничения в использовании отдельных сервисов, информационных систем, информационных ресурсов города {{city.cityName}} и их частей для учетных записей всех Пользователей, либо для отдельных категорий Пользователей.

  h3.mb-3 Права и обязанности Сторон
  h3.mb-3 Пользователь обязан:
  p.mb-3 Обеспечить своими силами и за свой счет доступ в информационно-телекоммуникационную сеть «Интернет», а также настройку и защиту от несанкционированного использования своего оборудования, а также оперативно реагировать при обнаружении случаев такого использования.
  p.mb-3 Обеспечивать сохранность пароля Пользователя и других средств идентификации Пользователя.
  p.mb-3 Принять полную ответственность за все обращения и действия, предпринятые через принадлежащую ему учетную запись, имевшие место после регистрации Пользователя.Соблюдать условия настоящего Соглашения.

  h3.mb-3 Пользователь имеет право:
  p.mb-3 Использовать функциональные возможности сервисов и информационных систем города {{city.cityName}} в соответствии с требованиями к соответствующим сервисам и информационным системам, а также в соответствии с настоящим Соглашением.
  p.mb-3 В установленном порядке направлять обращения Оператору, содержащие вопросы относительно технического функционирования сервисов и информационных систем города {{city.cityName}}
  p.mb-3 При использовании сервисов и (или) информационных систем, информационных ресурсов города {{city.cityName}} Пользователь не вправе:
  p.mb-3 Загружать, посылать, передавать или любым другим способом размещать и/или распространять контент, который является незаконным, законным владельцем или пользователем (автором) которого Пользователь не является, который является вредоносным, клеветническим, оскорбляет нравственность, демонстрирует (или является пропагандой) насилия и жестокости, нарушает права интеллектуальной собственности, пропагандирует ненависть и/или дискриминацию людей по расовому, этническому, половому, религиозному, социальному признакам, содержит оскорбления в адрес каких-либо лиц или организаций, содержит элементы (или является пропагандой) порнографии, детской эротики, представляет собой рекламу (или является пропагандой) услуг сексуального характера (в том числе под видом иных услуг), разъясняет порядок изготовления, применения или иного использования наркотических веществ или их аналогов, взрывчатых веществ или иного оружия.
  p.mb-3 Нарушать права третьих лиц, в том числе несовершеннолетних лиц и/или причинять им вред в любой форме.
  p.mb-3 Выдавать себя за другого человека или представителя организации и/или сообщества без достаточных на то прав, в том числе за сотрудников Оператора, а также применять любые другие формы и способы незаконного представительства других лиц, а также вводить пользователей или Оператора в заблуждение относительно свойств и характеристик каких-либо субъектов или объектов.
  p.mb-3 Загружать,	посылать,	передавать	или	любым	другим	способом	 размещать	и/или распространять контент, при	отсутствии	прав	на такие действия согласно законодательству Российской Федерации, нормативным правовым актам (наименование региона) и города {{city.cityName}} актам Оператора или каким-либо договорным отношениям.
  p.mb-3 Загружать,	посылать,	передавать	или	любым	другим	способом	размещать	и/или распространять не разрешенную специальным образом рекламную информацию и спам.
  p.mb-3 Загружать,	посылать,	передавать	или	любым	другим	способом	размещать	и/или распространять какие-либо материалы, содержащие вредоносные программы или другие компьютерные коды, файлы или программы, предназначенные для нарушения, уничтожения либо ограничения функциональности любого компьютерного или телекоммуникационного оборудования или программ, для осуществления несанкционированного доступа, а также серийные номера к коммерческим программным продуктам и программы для их генерации, логины, пароли и прочие средства для получения несанкционированного доступа к платным ресурсам в информационно-телекоммуникационной сети «Интернет», а также размещения ссылок на вышеуказанную информацию.
  p.mb-3 Несанкционированно собирать и хранить персональные данные других лиц.
  p.mb-3 Нарушать нормальную работу сервисов и (или) информационных систем города {{city.cityName}};
  p.mb-3 Содействовать действиям, направленным на нарушение ограничений и запретов, налагаемых Соглашением.
  p.mb-3 Другим образом нарушать нормы законодательства.

  h3.mb-3 Оператор обязан:
  p.mb-3 Обеспечить функционирование сервисов, информационных систем и ресурсов города {{city.cityName}}, относящихся к ведению Оператора, а также исполнять другие полномочия, установленные законодательством Российской Федерации, правовыми актами (наименование региона) и города {{city.cityName}}, актами Оператора.
  p.mb-3 Предоставить Пользователю функциональные возможности необходимого ему сервиса, информационной системы города {{city.cityName}} и (или) доступ к информационному ресурсу города {{city.cityName}} при соблюдении настоящего Соглашения.
  p.mb-3 В установленном порядке обеспечить безопасность, сохранность и неразглашение сведений, предоставляемых Пользователем.
  p.mb-3 Осуществлять иные обязательства, предусмотренные настоящим Соглашением.

  h3.mb-3 Оператор имеет право:
  p.mb-3 Отказать Пользователю в регистрации и использовании возможностей сервисов, информационных систем города {{city.cityName}}, в доступе к информационному ресурсу города {{city.cityName}} в случаях, предусмотренных законодательством Российской Федерации, нормативно правовыми актами (наименование региона) и города {{city.cityName}}, настоящим Соглашением.
  p.mb-3 Без предупреждения приостановить использование сервисов и информационных систем города {{city.cityName}} Пользователем в случаях: нарушения Пользователем условий данного Соглашения или осуществления Пользователем действий, которые Оператор обоснованно считает нарушающими условия Соглашения; в связи с непредвиденными проблемами технического характера или обстоятельствами, связанными с безопасностью; вследствие создания помех и любых нарушений со стороны Пользователя в отношении сервисов, информационных систем и ресурсов города {{city.cityName}}, включая использование любых устройств, программного обеспечения.
  p.mb-3 Направлять Пользователю сообщения, содержащие организационно-техническую информацию о функционировании информационных систем, сервисов города {{city.cityName}} а также о деятельности Оператора и иных органов местного самоуправления города {{city.cityName}} организаций.
  p.mb-3 Привлекать к обеспечению функционирования сервисов и информационных систем города {{city.cityName}}, ведению информационных ресурсов города {{city.cityName}} третьих лиц в установленном порядке.
  p.mb-3 Производить профилактические работы в сервисах и информационных системах города {{city.cityName}} с временным приостановлением их работы.


  h3.mb-3 Оператор не несет ответственности за:
  p.mb-3 Аварии, сбои или перебои в функционировании сервисов и информационных систем города {{city.cityName}}, в доступе к информационным ресурсам города {{city.cityName}}, связанные с нарушениями в работе оборудования, систем связи или сетей, которые обеспечиваются, подаются, эксплуатируются и/или обслуживаются третьими лицами.
  p.mb-3 Качество и сроки оказания государственных услуг, исполнения государственных и муниципальных функций органами местного самоуправления города {{city.cityName}}, подведомственными им организациями, действия иных организаций, а также за достоверность и актуальность информации, предоставляемой с использованием информационных систем и сервисов города {{city.cityName}} указанными органами и организациями.
  p.mb-3 Ущерб, понесенный Пользователем в результате: наличия "вирусов" и иных вредоносных программ в оборудовании и программном обеспечении, используемом Пользователем для доступа к сервисам, информационным системам и ресурсам города {{city.cityName}}; нарушения Пользователем настоящего Соглашения; неправомерных действий третьих лиц, в том числе связанных с использованием учетной записи Пользователя, а также с использованием сведений о пользователе, предоставленных им в ходе использования информационных систем и сервисов города {{city.cityName}}, если такие сведения стали доступны третьим лицами не по вине Оператора.
  p.mb-3 С использованием отдельных сервисов и (или) информационных систем города {{city.cityName}} в установленном порядке может обеспечиваться доступ к информационным ресурсам, информационным системам и сервисам, не относящимся к ведению Оператора (далее - ресурсы третьих лиц). Ресурсы третьих лиц не проверяются Оператором на предмет достоверности, полноты, законности и т.п. Оператор не несет ответственность за любую информацию, материалы, размещенные на ресурсах третьих лиц, в том числе за любые мнения или утверждения, рекламу и т.п., а также за доступность таких ресурсов или контента и последствия их использования Пользователем. В случае если указанные ресурсы находятся в ведении органов исполнительной власти (наименование региона), органов местного самоуправления города {{city.cityName}}, подведомственных им организаций, требования к ним устанавливаются законодательством Российской Федерации, соответствующими правовыми актами (наименование региона) и города {{city.cityName}}, актами органов исполнительной власти (наименование региона) и органов местного самоуправления города {{city.cityName}}, подведомственных им организаций.
  p.mb-3 Пользователь и Оператор не несут ответственности за неисполнение или ненадлежащее исполнение настоящего Соглашения, если надлежащее исполнение оказалось невозможным вследствие наступления обстоятельств непреодолимой силы.


  h3.mb-3 Прочие условия
  p.mb-3 Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Российской Федерации. Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению в соответствии с законодательством Российской Федерации. Все возможные споры, вытекающие из отношений, регулируемых настоящим Соглашением, разрешаются в порядке, установленном действующим законодательством Российской Федерации, по нормам российского права. Стороны согласовали условие о рассмотрении споров, вытекающих из настоящего Соглашения, в суде (наименование суда) города {{city.cityName}}.
  p.mb-3 Условия данного Соглашения действуют до тех пор, пока одна из сторон не заявит о своем намерении выйти из Соглашения, если законодательством Российской Федерации, (наименование региона) и нормативными правовыми актами города {{city.cityName}} не установлено иное.




</template>

<script>
export default {
  props: {
    cityName: {
      type: String,
      required: true
    }
  },
  computed: {
    city() {
      return this.$store.state[this.cityName]
    }
  }
}
</script>

<style lang="stylus">
#TXT_user_agreement
  height 60vh
  overflow-y scroll
</style>
