<template lang="pug" functional>

article
  h2.mb-3 Проект «Умные города Росатома»

  p.mb-3 Проект «Умные города Росатома» призван помочь «атомным» городам пройти период цифровой трансформации: сделать цифровые технологии частью городского управления, создавать более комфортные условия для жителей и малого и среднего бизнеса, применять новые онлайн-каналы обратной связи и вовлечения горожан в вопросы городского развития. 

  p.mb-3 Основой цифрового развития выбран программный комплекс «Умный город Росатома» разработки АО «Русатом Инфраструктурные решения» – отраслевого интегратора по цифровизации городской среды. Цифровой комплекс передается городам-участникам на безвозмездной основе. Базовый функционал системы позволяет администрациям отслеживать исполнение задач коммунальными службами, жителям – получать информацию о работе городских служб, образовательных и культурных учреждений, полицейских участков, а депутатам – контролировать качество выполнения работ. Дальнейшие развитие системы будет происходить с учетом потребностей администраций и запросов жителей городов.

  p.mb-3 Цифровая платформа Росатома «Умный город» – единая информационная основа для внедрения цифровых городских сервисов. Она направлена на реализацию государственной политики в сфере развития цифровой экономики Российской Федерации и охватывает все направления рекомендованного набора элементов «умного» города, указанных в методических рекомендациях по подготовке регионального проекта «Умные города» Минстроя РФ. Это 100% российская разработка, учитывающая требования к информационной безопасности и импортозамещению. Цифровая платформа впервые реализована в городе Сарове Нижегородской области.

  p.mb-3 Сегодня в проекте 12 «атомных» городов: Саров (Нижегородская область), Железногорск, Зеленогорск (Красноярский край), Заречный (Пензенская область), Глазов (Удмуртская республика), Северск (Томская область), Новоуральск, Лесной, Заречный (Свердловская область), Озерск, Снежинск, Трехгорный (Челябинская область). С развитием проекта число участников будет расширяться, вовлекая больше городов присутствия предприятий атомной отрасли.



</template>

<script>
export default {}
</script>

<style></style>
